Repository: bvibber/mediawiki-svn
Catalog: debs/squid/debian/po/*.po
Languages: ru

source: The http_anonymizer directive has been replaced with header_replace and header_access.
ru: Директива http_anonymizer была заменена на header_replace и header_access.

source: The http_anonymizer directive that was present in squid 2.1 and 2.2 doesn't exist anymore in squid 2.3 and up. It has been replaced with header_replace and header_access that provide more fine-grained control over HTTP headers. Right now, your squid doesn't anonymize the HTTP headers anymore so you probably want to fix this. The new format is explained in the new 2.5 config file, of which you probably have a copy in /usr/share/doc/squid/examples/squid.conf.
ru: Директива http_anonymizer, которая присутствовала в squid 2.1 и 2.2, не существует более в squid 2.3 и выше. Она была заменена директивами header_replace и header_access, которые обеспечивают более тонкий контроль над заголовками HTTP. Сейчас ваш squid не анонимизирует заголовки HTTP, так что вам скорее всего надо исправить это. Новый формат описан в новом файле настроек версии 2.5, копию которого вы можете найти в /usr/share/doc/squid/examples/squid.conf.

source: The anonymize_headers and fake_user_agent directives have been replaced with header_access and header_replace.
ru: Директивы anonymize_headers и fake_user_agent были заменены на header_access и header_replace.

source: The anonymize_headers and fake_user_agent directives that were present in squid 2.3 and 2.4 don't exist anymore in squid 2.5 and up. They have been replaced with header_replace and header_access that provide more fine-grained control over HTTP headers. Right now, your squid doesn't anonymize the HTTP headers anymore so you probably want to fix this. The new format is explained in the new 2.5 config file, of which you probably have a copy in /usr/share/doc/squid/examples/squid.conf.
ru: Директивы anonymize_headers и fake_user_agent, которые присутствовали в squid 2.3 и 2.4, не существуют более в squid 2.5 и выше. Они были заменены директивами header_replace и header_access, которые обеспечивают более тонкий контроль над заголовками HTTP. Сейчас ваш squid не анонимизирует заголовки HTTP, так что вам скорее всего надо исправить это. Новый формат описан в новом файле настроек версии 2.5, копию которого вы можете найти в /usr/share/doc/squid/examples/squid.conf.

source: There is no automatic upgrade path to squid 2.5.
ru: Не существует автоматического способа обновления до squid 2.5.

source: SQUID 2.5 INSTALLATION WARNING
ru: ПРЕДУПРЕЖДЕНИЕ ПРИ УСТАНОВКЕ SQUID 2.5

source: You are upgrading squid from an 1.x version to the 2.5 version. The 1.x and 2.5 versions are NOT compatible. The structure of the cache directory is different and the configuration file "squid.conf" is not entirely compatible.
ru: Вы обновляете squid от версии 1.x до версии 2.5. Версии 1.x и 2.5 НЕСОВМЕСТИМЫ. Изменилась структура кэш-директории и не полностью совместим файл настроек "squid.conf".

source: If you have an old cache directory, please quit NOW and remove the old cache by hand (in /var/spool/squid). Then re-install this squid version.
ru: Если у вас есть старая кэш-директория, выйдите СЕЙЧАС и удалите старый кэш вручную (в /var/spool/squid). Затем переустановите эту версию squid.

source: Also, please accept the new configuration file. After upgrading your old configuration file can be found in "/etc/squid.conf.dpkg-old". Then you have to edit the new configuration file by hand to match your old configuration.
ru: Также примите новый файл настроек. После обновления ваш старый файл можно найти в "/etc/squid.conf.dpkg-old". Затем вы должны вручную отредактировать новый файл до совпадения с вашей старой настройкой.

source: Do you want to quit now?
ru: Желаете выйти сейчас?

source: squid-cgi now uses config file for target ACL
ru: squid-cgi теперь использует файл настроек для контроля целей

source: squid-cgi now checks a configuration file before connecting to the target host. Only allowed target will be contacted. Please add hosts you want to access to the file /etc/squid/cachemgr.conf, one per line in the form
ru: squid-cgi теперь проверяет файл настроек перед подключением к целевому хосту. Соединение будет установлено только с разрешенными целями. Добавьте хосты, к которым вы хотите получить доступ, в файл /etc/squid/cachemgr.conf, по одному хосту на строке в формате

source: hostname:port
ru: хост:порт

source: Upgrade squid.conf automatically?
ru: Обновить squid.conf автоматически?

source: Incompatible settings have been found in the existing squid.conf file; they will prevent squid from starting or working correctly. However, this setup can try to modify them to work again. Do you want to apply the changes?
ru: Несовместимые настройки найдены в существующем файле squid.conf; они не позволят squid стартовать или корректно работать. Однако, эта установкаможет попробовать изменить их до работоспособного вида. Хотите принять изменения?

source: The authenticate_program directive has been replaced with auth_param.
ru: Директива authenticate_program была заменена на auth_param.

source: The authenticate_program directive that was present in squid <= 2.4 doesn't exist anymore in squid 2.5 and up. All authentication directives have been replaced with auth_param. Right now, your squid doesn't authenticate users anymore so you probably want to fix this. The new format is explained in the new 2.5 config file, of which you probably have a copy in /usr/share/doc/squid/examples/squid.conf.
ru: Директива authenticate_program, которая присутствовала в squid <=2.4, не существует более в squid 2.5 и выше. Все директивы аутентификации были заменены на auth_param. Сейчас ваш squid не выполняет аутентификацию пользователей, так что вам скорее всего надо исправить это. Новый формат описан в новом файле настроек версии 2.5, копию которого вы можете найти в /usr/share/doc/squid/examples/squid.conf.

source: Warning: squid may crash when logfiles size is bigger than 2GB.
ru: Предупреждение: squid может упасть, когда размер log-файла более 2GB.

source: Squid may crash if any of the logfiles grows bigger than 2GB. Please configure /etc/logrotate.d/squid accordingly to your site's traffic.
ru: Squid может упасть, когда любой log-файл вырастет более 2GB. Настройте /etc/logrotate.d/squid в соответствии с трафиком вашей системы.

source: Fix permissions of cache_dir?
ru: Исправить права доступа на cache_dir?

source: Values for cache_effective_user and/or cache_effective_group in config file are incompatible with owner/group of cache directories. Do you want to automatically fix permissions on cache directory?
ru: Значения cache_effective_user и/или cache_effective_group из файла настроек не соответствуют владельцу/группе кэш-директории. Желаете автоматически исправить права доступа на кэш-директорию?

source: WARNING: If you specified a cache directory different from /var/spool/squid and selected some other directory used by other programs (e.g. /tmp), this could affect those programs.
ru: ПРЕДУПРЕЖДЕНИЕ: Если вы указали кэш-директорию, отличающуюся от /var/spool/squid, и выбрали другую директорию, которую используют прочие программы (например. /tmp), ваши действия могут повлиять на работоспособность этих программ.
