Repository: bvibber/mediawiki-svn
Catalog: 1.0/po/*.po
Languages: fr

source: Discloses fundraising data while preserving requested donor privacy.
fr: Les données fournies pour la collecte de fonds respectent la vie privée du donateur.

source: Fundraising C.O.R.E.
fr: Collecte d'argent C.O.R.E.

source: Live contributions
fr: Les dons en direct

source: Browse by date
fr: Tri par date

source: Count
fr: Nombre de dons

source: Mean
fr: Moyenne

source: Standard Deviation
fr: Écart-type

source: Statistical breakdown (%currency)
fr: Statistiques en (%currency)

source: Currency
fr: Monnaie

source: Amount
fr: Montant

source: Equivalent in %currency
fr: Équivalence en %currency

source: Breakdown by currency
fr: Classement par monnaie

source: Browsing contributions
fr: Trier par don

source: Browsing year %year
fr: Trier par année %year

source: Browsing month %year-%month
fr: Trier par mois %month-%year

source: Browsing day %year-%month-%day
fr: Trier par jour %day-%month-%year

source: Year
fr: Année

source: Month
fr: Mois

source: Day
fr: Jour

source: Filter contribution results
fr: Filtrer les résultats

source: On or after
fr: À partir du

source: On or before
fr: Jusqu'au

source: Total in %currency
fr: Total en %currency

source: Restrict to a specific currency
fr: Filtrer sur une monnaie

source: Only show contributions with comments
fr: Ne montrer que les dons avec commentaires

source: View results
fr: Voir les résultats

source: Anonymous
fr: Anonyme

source: Sorry, there are no matching contributions.
fr: Désolé, il n'y a pas de don correspondant à vos critères.

source: Name and Comment
fr: Nom et commentaire

source: Time (%timezone)
fr: Heure (%timezone)
