<?php
/*
 * arabic phone phrases for hawpedia
 * $Date$
 */

$phrase = Array(
"404" => "لا يوجد مقال في ويكيبيديا يطابق مدخلاتك",
"credits" => "أنت تسمع مقالا من ويكيبيديا. تاريخ النسخ وقائمة المؤلفين متوفرة على الإنترنت.",
"enter_search_term" => "من فضلك أدخل نص بحثك",
"for" => "ل",
"input_too_short" => "من فضلك أدخل على الأقل 4 أرقام",
"preamble" => "أنت تسمع مقالا من ويكيبيديا. المحتوى متوفر تحت شروط رخصة جنو للوثائق الحرة.",
"result_counter" => "تم العثور على ??? مقال. من فضلك ادخل ",
"too_many_articles_found" => "مدخلك نتج عنه نتائج كثيرة جدا",
"undefined_error" => "حدث خطأ",
"welcome" => "مرحبا بك في ويكيبيديا",
"###end###"=>"###end###");

?>
